In [2]:
#structur data in python
#1.list
number = [1,2,3,4,5]
number

[1, 2, 3, 4, 5]

In [3]:
number.append(6)

In [4]:
number

[1, 2, 3, 4, 5, 6]

In [5]:
number[1:3]

[2, 3]

In [6]:
number[:3]

[1, 2, 3]

In [7]:
#2.dictionary
# ada dua element dictionary keys & values
biodata = {
    "nama": "Nikky",
    "umur": 22,
    "tempat_tinggal": "Malang",
}

In [8]:
biodata.keys()

dict_keys(['nama', 'umur', 'tempat_tinggal'])

In [9]:
biodata.values()

dict_values(['Nikky', 22, 'Malang'])

In [10]:
#data frame library pandas
import pandas as pd

In [15]:
# import file csv
df = pd.read_csv("USA_cars_datasets.csv")

In [29]:
#menampilkan 5 nilai teratas
df.head()

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,0,6300,toyota,cruiser,2008,clean vehicle,274117.0,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,1,2899,ford,se,2011,clean vehicle,190552.0,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left
2,2,5350,dodge,mpv,2018,clean vehicle,39590.0,silver,3c4pdcgg5jt346413,167655728,georgia,usa,2 days left
3,3,25000,ford,door,2014,clean vehicle,64146.0,blue,1ftfw1et4efc23745,167753855,virginia,usa,22 hours left
4,4,27700,chevrolet,1500,2018,clean vehicle,6654.0,red,3gcpcrec2jg473991,167763266,florida,usa,22 hours left

In [36]:
#operasi data frame
# 1. mengetahui dimesi (row ?, column ?)
df.shape

(2499, 13)

In [37]:
# 2. deskripsi data frame
df.describe()

        Unnamed: 0         price         year       mileage           lot
count  2499.000000   2499.000000  2499.000000  2.499000e+03  2.499000e+03
mean   1249.000000  18767.671469  2016.714286  5.229869e+04  1.676914e+08
std     721.543484  12116.094936     3.442656  5.970552e+04  2.038772e+05
min       0.000000      0.000000  1973.000000  0.000000e+00  1.593488e+08
25%     624.500000  10200.000000  2016.000000  2.146650e+04  1.676253e+08
50%    1249.000000  16900.000000  2018.000000  3.536500e+04  1.677451e+08
75%    1873.500000  25555.500000  2019.000000  6.347250e+04  1.677798e+08
max    2498.000000  84900.000000  2020.000000  1.017936e+06  1.678055e+08

In [38]:
df.price.describe()

count     2499.000000
mean     18767.671469
std      12116.094936
min          0.000000
25%      10200.000000
50%      16900.000000
75%      25555.500000
max      84900.000000
Name: price, dtype: float64

In [39]:
#membuat kolom baru
df["new_column"] = "new Value"

In [41]:
df.head()

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition,new_column
0,0,6300,toyota,cruiser,2008,clean vehicle,274117.0,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left,new Value
1,1,2899,ford,se,2011,clean vehicle,190552.0,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left,new Value
2,2,5350,dodge,mpv,2018,clean vehicle,39590.0,silver,3c4pdcgg5jt346413,167655728,georgia,usa,2 days left,new Value
3,3,25000,ford,door,2014,clean vehicle,64146.0,blue,1ftfw1et4efc23745,167753855,virginia,usa,22 hours left,new Value
4,4,27700,chevrolet,1500,2018,clean vehicle,6654.0,red,3gcpcrec2jg473991,167763266,florida,usa,22 hours left,new Value

In [42]:
#mengambil row 5 terkahir
df.tail()

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition,new_column
2494,2494,7800,nissan,versa,2019,clean vehicle,23609.0,red,3n1cn7ap9kl880319,167722715,california,usa,1 days left,new Value
2495,2495,9200,nissan,versa,2018,clean vehicle,34553.0,silver,3n1cn7ap5jl884088,167762225,florida,usa,21 hours left,new Value
2496,2496,9200,nissan,versa,2018,clean vehicle,31594.0,silver,3n1cn7ap9jl884191,167762226,florida,usa,21 hours left,new Value
2497,2497,9200,nissan,versa,2018,clean vehicle,32557.0,black,3n1cn7ap3jl883263,167762227,florida,usa,2 days left,new Value
2498,2498,9200,nissan,versa,2018,clean vehicle,31371.0,silver,3n1cn7ap4jl884311,167762228,florida,usa,21 hours left,new Value

In [43]:
#menampilkan data random row
df.sample()

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition,new_column
1571,1571,16600,ford,fusion,2019,clean vehicle,27774.0,white,3fa6p0ru3kr180188,167745445,pennsylvania,usa,2 days left,new Value

In [48]:
#mengambil beberapa kolom
df[["price","brand","model","year"]].head()

   price      brand    model  year
0   6300     toyota  cruiser  2008
1   2899       ford       se  2011
2   5350      dodge      mpv  2018
3  25000       ford     door  2014
4  27700  chevrolet     1500  2018